from typing import Optional

GLOBAL_MSG_CONFIG = {
    "info_msg_cfg": {
        "hoodie": {
            "msg": """Стоимость худи в базовых цветах (черный, графит, синий-электрик и молочный):

4990 – худи из каталога
5490 – с вашей собственной фразой
6990 – более сложный кастом


Стоимость худи овер в цвете молочный шоколад и розовый, серый-меланж, оранжевый и зеленый:

5490 – худи из каталога
5990 – с вашей собственной фразой
6990 – более сложный кастом

Стоимость указана за худи с учетом нанесения вышивки.""",
            "button_name": "худи овер",
        },
        "sweet": {
            "msg": """Стоимость свитшотов овер в базовых цветах (черный, графит, синий-электрик и молочный):

3990 – свитшот из каталога
4490 – с вашей собственной фразой
5490 – более сложный кастом

Все остальные цвета из новых линеек:

4490 – свитшот из каталога
4990 – с вашей собственной фразой
5490 – более сложный кастом""",
            "button_name": "свит овер",
        },
        "t-shirt": {
            "msg": """Стоимость базовых футболок в классических цветах (черный, графит, синий-электрик и молочный):

2490 – с любой нашей фразой
2990 – с вашей собственной фразой
3990 – более сложный кастом""",
            "button_name": "базовые футболки",
        },
        "t-shirt-true-over": {
            "msg": """Стоимость футболок тру-овер в классических цветах (черный, холодный белый):

2990 – с любой нашей фразой
3490 – с вашей собственной фразой
4490 – более сложный кастом


Футболки тру-овер в розовом цвете:

3490 – с любой нашей фразой
3990 – с вашей собственной фразой
4490 – более сложный кастом""",
            "button_name": "футболки тру-овер",
        },
        "pants": {
            "msg": """Брюки спорт во всех цветах доступны по единой цене: 3990 руб.""",
            "button_name": "брюки и шорты",
        },
        "longsleeve": {
            "msg": """Базовые лонгсливы со свободной посадкой доступны в черном и молочно-белом цвете.

2990 – с любой нашей фразой
3490 – с вашей собственной фразой
4490 – более сложный кастом""",
            "button_name": "лонгсливы",
        },
    },
    "business_msg_cfg": {
        "main_msg": """Мы делаем мерч под ключ для бизнеса от 10 до 1000 человек. Чтобы получить индивидуальный расчет напишите пожалуйста описание заказа:

Какие модели вас интересуют и в каком цвете, какое количество и описание тз для нанесения. Мы делаем вышивки и шелкографию по запросу.""",
        "collections_msg": """При заказе до 100 единиц включительно вы можете выбрать любую позицию из ассортимента нашего каталога и добавить индивидуальное нанесение вашего логотипа, макета или текста.

Наш основной ассортимент: худи (футер, флис, garment dyed), футболки из трикотажа любого вида, шорты, спортивные штаны, бомберы, поло, шопперы, индивидуальные аксессуары.

При заказе от 100 единиц доступен индивидуальный пошив.""",
        "Q&A": {
            "best_practice": {
                "button_name": "Что мы делаем лучше всего?",
                "msg": """todo""",
            },
            "application_type": {
                "button_name": "Какие типы нанесения мы используем?",
                "msg": """todo""",
            },
            "minimum_order": {
                "button_name": "Какой минимальный тираж?",
                "msg": """todo""",
            },
            "cost_calculation": {
                "button_name": "Что нужно для расчета стоимости?",
                "msg": """todo""",
            },
            "samples": {"button_name": "Как получить образцы?", "msg": """todo"""},
            "one_item": {
                "button_name": "Можно ли заказать 1 единицу?",
                "msg": """todo""",
            },
            "production_time": {
                "button_name": "Срок изготовления партии",
                "msg": """todo""",
            },
        },
    },
    "custom_msg_cfg": {
        "main_msg": """Вы можете выбрать любую нашу модель и добавить свою фразу. Мы делаем только вышивку. Стоимость с вышивкой вашей фразы:

худи овер в базовых цветах – 5490
свит овер в базовых цветах – 4490
базовые футболки от 2990
футболки тру овер от 3490"""
    },
    "manufacturing_msg_cfg": {
        "main_msg": """Срок изготовления для новых заказов сейчас 7-10 рабочих дней с момента оплаты.

Доставка занимает в среднем 1-3 рабочих дня и стоит в среднем 300-500 рублей. Чтобы уточнить стоимость доставки напишите, пожалуйста, в каком городе хотели бы получить заказ."""
    },
}
INFO_MSG_CONFIG = GLOBAL_MSG_CONFIG.get("info_msg_cfg")
BUSINESS_MSG_CONFIG = GLOBAL_MSG_CONFIG.get("business_msg_cfg")
CUSTOM_MSG_CONFIG = GLOBAL_MSG_CONFIG.get("custom_msg_cfg")
MANUFACTURING_MSG_CONFIG = GLOBAL_MSG_CONFIG.get("manufacturing_msg_cfg")


def get_price_msg(
        cloth_type: str,
) -> Optional[dict]:  # todo подумать может ошибку какую выкидывать если пусто
    return INFO_MSG_CONFIG.get(cloth_type)

#  todo Изменение переменных реализовать в отдельном приложении на фастапи или джанго. При перезагрузке тг бота,
# бот должен http запросом подтягивать конфиги, проверять их и на них работать
