from typing import Optional

INFO_MSG_CONFIG = {
    'hoodie': {'msg': '''Стоимость худи в базовых цветах (черный, графит, синий-электрик и молочный):

4990 – худи из каталога
5490 – с вашей собственной фразой
6990 – более сложный кастом


Стоимость худи овер в цвете молочный шоколад и розовый, серый-меланж, оранжевый и зеленый:

5490 – худи из каталога
5990 – с вашей собственной фразой
6990 – более сложный кастом

Стоимость указана за худи с учетом нанесения вышивки.''', 'button_name': 'худи овер'},
    'sweet': {'msg': '''Стоимость свитшотов овер в базовых цветах (черный, графит, синий-электрик и молочный):

3990 – свитшот из каталога
4490 – с вашей собственной фразой
5490 – более сложный кастом

Все остальные цвета из новых линеек:

4490 – свитшот из каталога
4990 – с вашей собственной фразой
5490 – более сложный кастом''', 'button_name': 'свит овер'},
    't-shirt': {'msg': '''Стоимость базовых футболок в классических цветах (черный, графит, синий-электрик и молочный):

2490 – с любой нашей фразой
2990 – с вашей собственной фразой
3990 – более сложный кастом''', 'button_name': 'базовые футболки'},
    't-shirt-true-over': {'msg': '''Стоимость футболок тру-овер в классических цветах (черный, холодный белый):

2990 – с любой нашей фразой
3490 – с вашей собственной фразой
4490 – более сложный кастом


Футболки тру-овер в розовом цвете:

3490 – с любой нашей фразой
3990 – с вашей собственной фразой
4490 – более сложный кастом''', 'button_name': 'футболки тру-овер'},
    'pants': {'msg': '''Брюки спорт во всех цветах доступны по единой цене: 3990 руб.''',
              'button_name': 'брюки и шорты'},
    'longsleeve': {'msg': '''Базовые лонгсливы со свободной посадкой доступны в черном и молочно-белом цвете.

2990 – с любой нашей фразой
3490 – с вашей собственной фразой
4490 – более сложный кастом''', 'button_name': 'лонгсливы'}
}  # todo change to db later


def get_price_msg(cloth_type: str) -> Optional[dict]:  # todo подумать может ошибку какую выкидывать если пусто
    return INFO_MSG_CONFIG.get(cloth_type)


#  todo Изменение переменных реализовать в отдельном приложении на фастапи или джанго. При перезагрузке тг бота,
# бот должен http запросом подтягивать конфиги, проверять их и на них работать
